ХМНПФ_Общее/Documents/уп_ЗаявлениеЗЛОЕдиновременнойВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ЗаявлениеЗЛОЕдиновременнойВыплате</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПолучаемойПенсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ФормыВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодаетсяПредставителем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаимДокПодтвПолнПредставителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ЗЗЛПрилагаемыеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерияДокПодтвПолнПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерДокПодтвПолнПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыдачиДокПодтвПолнПредставителя1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КемВыданДокПодтвПолнПредставителя2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроживаетЗаГраницей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОстатокНаСчете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеУчитыватьДопВзносы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОстатокДопФинансирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ЛицевыеСчетаЗастрахованныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ЛицевыеСчетаЗастрахованныхЛиц</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ФормыВыплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипВыплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыВыплат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗастрахованноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ЗаявлениеЗЛОЕдиновременнойВыплате/Ext/ObjectModule.bsl
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 26.10.2015 Шадрин А.В. // ОбработкаЗаполнения() // ОПС_заяв_на_основ_дгвр
	// ХМНПФ+ 26.10.2015 Шадрин А.В. // Реквизиту ДокументОснование добавлен Тип СправочникСсылка.уп_ДоговорыОПС // ОПС_заяв_на_основ_дгвр
	// ХМНПФ 30.10.2015 Шадрин А.В. // ОбработкаЗаполнения() // №24
	// ХМНПФ 19.02.2017 Кучеров // Новая Функция ХМ_ПечатьWeb()
	// ХМНПФ 19.02.2017 Кучеров // Модуль убрал директиву на клиенте т.к. процедуры (функции) получения печатных форм должны выполняться и на сервере
	// ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокумента()	// №3395
	// ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокументаСервер()	// №3395
	// ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер() // №3395
КонецПроцедуры

&ИзменениеИКонтроль("ПечатьДокумента")
Функция РасшОбщ_ПечатьДокумента(ИмяМакета)
	Шапка = ВыбратьДанныеОЗЛ();
	Шапка.Следующий();
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет(ИмяМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Титул");
	ОбластьМакета.Параметры.НаименованиеНПФ = Организация.НаименованиеПолное;
	Фамилия = Шапка.Фамилия;
	Имя = Шапка.Имя;                
	Отчество = Шапка.Отчество;
	
	ОбластьМакета.Параметры.ФамилияЗЛ = Фамилия;
	ОбластьМакета.Параметры.ИмяЗЛ = Имя;
	ОбластьМакета.Параметры.ОтчествоЗЛ = Отчество;
	Если Участник.уп_ФизЛицо.Пол=Перечисления.ПолФизическогоЛица.Женский Тогда
		ОбластьМакета.Параметры.КартинкаПолЖен = "V";
	ИначеЕсли Участник.уп_ФизЛицо.Пол=Перечисления.ПолФизическогоЛица.Мужской Тогда
		ОбластьМакета.Параметры.КартинкаПолМуж = "V";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДоговорОПС) Тогда
		ОбластьМакета.Параметры.НомерСчета = "";
	Иначе
		#Удаление
		ОбластьМакета.Параметры.НомерСчета = СокрЛП(ДоговорОПС.Код)+"/"+уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
		#КонецУдаления
		#Вставка
		// +ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокумента()	// №3395
		ОбластьМакета.Параметры.НомерСчета = СокрЛП(ДоговорОПС.Код);
		// -ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокумента()	// №3395
		#КонецВставки
	КонецЕсли;
	
	Если ТипПолучаемойПенсии = 1 Тогда
		ОбластьМакета.Параметры.Картинка1 = "V";
	ИначеЕсли ТипПолучаемойПенсии = 2 Тогда
		ОбластьМакета.Параметры.Картинка2 = "V";
	ИначеЕсли ТипПолучаемойПенсии = 3 Тогда
		ОбластьМакета.Параметры.Картинка3 = "V";
	ИначеЕсли ТипПолучаемойПенсии = 4 Тогда
		ОбластьМакета.Параметры.Картинка4 = "V";
	ИначеЕсли ТипПолучаемойПенсии = 5 Тогда
		ОбластьМакета.Параметры.Картинка5 = "V";
	Иначе
		ОбластьМакета.Параметры.Картинка1 = "";
		ОбластьМакета.Параметры.Картинка2 = "";
		ОбластьМакета.Параметры.Картинка3 = "";
		ОбластьМакета.Параметры.Картинка4 = "";
		ОбластьМакета.Параметры.Картинка5 = "";
	КонецЕсли;
	
	ОбластьМакета.Параметры.ДатаРождения = Формат(Участник.уп_ФизЛицо.ДатаРождения, "ДЛФ=DD");
	ОбластьМакета.Параметры.МестоРождения = ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(Участник.уп_ФизЛицо.МестоРождения);
	
	// создаем запрос для поиска в регистре сведений контактная информация
	// с параметрами юридический адрес контрагента, самого контрагента и отображаем в поле макета
	КонтактыЗЛ=ВыбратьКонтактыЗЛ();
	КонтактыЗЛ.Следующий();
	ЗаполнитьКонтактыЗЛ(КонтактыЗЛ,ОбластьМакета);
	
	Паспорт=ВыбратьПаспортДанные();
	Паспорт.Следующий();
	Граждаство=ОпределитьГражданство(Паспорт);
	ОбластьМакета.Параметры.ДокументУЛ = Паспорт.ДокументВид;
	ОбластьМакета.Параметры.СерияНомерПаспорта = Паспорт.ДокументСерия+" №"+Паспорт.ДокументНомер;
	ОбластьМакета.Параметры.ДатаВыдачи = Паспорт.ДокументДатаВыдачи;
	ОбластьМакета.Параметры.ПаспортКемВыдан = Паспорт.ДокументКемВыдан;
	ОбластьМакета.Параметры.Гражданство_ЗЛ = Граждаство;
	
	ОбластьМакета.Параметры.НомерПФР = уп_ОПС.ПреобразоватьНомерПФР(Участник.уп_ФизЛицо.СтраховойНомерПФР);
	
	Если ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
		ОбластьМакета.Параметры.Картинка7 = "V";
	ИначеЕсли ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Почта 
		или ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
		или ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
		или ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда
		ОбластьМакета.Параметры.Картинка8 = "V";
	ИначеЕсли ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
		ОбластьМакета.Параметры.Картинка9 = "V";
	Иначе
		ОбластьМакета.Параметры.Картинка7 = "";
		ОбластьМакета.Параметры.Картинка8 = "";
		ОбластьМакета.Параметры.Картинка9 = "";
	КонецЕсли;
	
	//параметры расчетного счета
	
	ОбластьМакета.Параметры.НомерРасчСчета = РасчетныйСчет.НомерСчета;
	ОбластьМакета.Параметры.НаименованиеБанка = РасчетныйСчет.Банк.Наименование;
	ОбластьМакета.Параметры.БИК = РасчетныйСчет.Банк.Код;
	ОбластьМакета.Параметры.КоррСчет = РасчетныйСчет.Банк.КоррСчет;
	
	ТабДокумент.Вывести(ОбластьМакета);
	//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); //-
	
	ОбластьМакета = Макет.ПолучитьОбласть("Оборот");
	
	
	Если ПодаетсяПредставителем Тогда
		ОбластьМакета.Параметры.ВидДППП=НаимДокПодтвПолнПредставителя;
		ОбластьМакета.Параметры.НомерДППП=СерияДокПодтвПолнПредставителя+" №"+НомерДокПодтвПолнПредставителя;
		ОбластьМакета.Параметры.ДатаВыдачиДППП=ДатаВыдачиДокПодтвПолнПредставителя1;
		ОбластьМакета.Параметры.КемВыданДППП=КемВыданДокПодтвПолнПредставителя2;                
		ВидДоверенногоЛица=ВыбратьВидДоверЛица();
		ВидДоверенногоЛица.Следующий();
		ПредставительЮрФизЛицо=ВидДоверенногоЛица.ПредставительЮрФизЛицо;
		//Подчеркивание типа представителя
		СплЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		ПодчеркнутьВидПредставительства(ОбластьМакета,СплЛиния);
		КонтактыПредставителяЗЛ=ВыбратьКонтактыПредставителяЗЛ();
		КонтактыПредставителяЗЛ.Следующий();
		
		РасшПредставителя= Строка(Шапка.ФамилияП+" "+Сред(Шапка.ИмяП,1,1)+ "." +Сред(Шапка.ОтчествоП,1,1)+".");
		
		//Заполнение адреса проживания и адреса пребывания представителя
		ЗаполнитьКонтактыПредставителя(ОбластьМакета,КонтактыПредставителяЗЛ,Шапка);
		
		ПаспортПЗЛ=ПолучитьПаспортПЗЛ();
		ПаспортПЗЛ.Следующий();
		ДатаВыдачиДУЛПЗЛ = ПаспортПЗЛ.ДокументДатаВыдачи;
		ОбластьМакета.Параметры.ДокументУЛПЗЛ = ПаспортПЗЛ.ДокументВид;
		ОбластьМакета.Параметры.СерияНомерПаспортаДоверенного = ?(ПаспортПЗЛ.ДокументСерия=NULL,"",ПаспортПЗЛ.ДокументСерия)+" №"+?(ПаспортПЗЛ.ДокументНомер=NULL,"",ПаспортПЗЛ.ДокументНомер);
		ОбластьМакета.Параметры.ДатаВыдачиДоверенного = ДатаВыдачиДУЛПЗЛ;
		ОбластьМакета.Параметры.ПаспортКемВыданДоверенного = ПаспортПЗЛ.ДокументКемВыдан;
	КонецЕсли;
	
	//ОбластьМакета.Параметры.ДатаЗаявления = Дата;
	#Удаление
	ОбластьМакета.Параметры.ДатаРегистрации = ДатаРегистрации;
	#КонецУдаления
	#Вставка
	// +ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокумента() // №3395
	ОбластьМакета.Параметры.ДатаРегистрации = Дата;	
	// -ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокумента // №3395
	#КонецВставки
	//ОбластьМакета.Параметры.НомерЗаявления = Номер; //-
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаботникиОрганизацийСрезПоследних.Должность
	               |ИЗ
	               |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(
	               |			&Период,
	               |			Сотрудник.Физическоелицо = &ОтветственныйФизЛицо
	               |				И Организация = &Организация) КАК РаботникиОрганизацийСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РаботникиОрганизацийСрезПоследних.Период УБЫВ";		
	Запрос.УстановитьПараметр("Период", ДатаРегистрации);
	Запрос.УстановитьПараметр("ОтветственныйФизЛицо", Ответственный.ФизЛицо);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ТЗДолжностьОтветственного = Запрос.Выполнить().Выгрузить();
	
	//ТЗДолжностьОтветственного = РегистрыСведений.РаботникиОрганизаций.СрезПоследних(ДатаРегистрации, Новый Структура("ФизЛицо, Организация",Ответственный.ФизЛицо,Организация));
	Если ТЗДолжностьОтветственного.Количество()>0 Тогда
		ОбластьМакета.Параметры.ДолжностьОтветственного = ТЗДолжностьОтветственного.Получить(0).Должность;
	Иначе
		ОбластьМакета.Параметры.ДолжностьОтветственного = "";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		ФИООтветственного = "";
		ОбластьМакета.Параметры.ФИООтветственного = "";
	Иначе
		ФИООтветственного = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", Ответственный.ФизЛицо));
		ОбластьМакета.Параметры.ФИООтветственного = Лев(ФИООтветственного.Имя,1)+"."+Лев(ФИООтветственного.Отчество,1)+"."+ФИООтветственного.Фамилия;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Расписка");
	ОбластьМакета.Параметры.НаименованиеНПФ = Организация.НаименованиеПолное;
	#Удаление
	ОбластьМакета.Параметры.ДатаРегистрации = ДатаРегистрации;
	#КонецУдаления
	#Вставка
	// +ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокумента() // №3395
	ОбластьМакета.Параметры.ДатаРегистрации = Дата;
	// -ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокумента // №3395
	#КонецВставки
	ОбластьМакета.Параметры.НомерРасписки = Номер;
	ОбластьМакета.Параметры.ФИОЗЛица = Фамилия+" "+Имя+" "+Отчество;
	#Удаление
	ОбластьМакета.Параметры.НомерСчетаЗЛица = СокрЛП(ДоговорОПС.Код)+"/"+уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
	#КонецУдаления
	#Вставка
	// +ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокумента()	// №3395
	ОбластьМакета.Параметры.НомерСчетаЗЛица = СокрЛП(ДоговорОПС.Код);
	// -ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокумента()	// №3395
	#КонецВставки
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		ФИООтветственного = "";
		ОбластьМакета.Параметры.ФИООтветственного = "";
	Иначе
		ФИООтветственного = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", Ответственный.ФизЛицо));
		ОбластьМакета.Параметры.ФИООтветственного = Лев(ФИООтветственного.Имя,1)+"."+Лев(ФИООтветственного.Отчество,1)+"."+ФИООтветственного.Фамилия;
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);
	Возврат ТабДокумент;
КонецФункции

&ИзменениеИКонтроль("ПечатьДокументаСервер")
Функция РасшОбщ_ПечатьДокументаСервер(ТабДокумент,ИмяМакета="Заявление2019") Экспорт
	Шапка = ВыбратьДанныеОЗЛСервер();
	Шапка.Следующий();
	
	Если ТабДокумент=Неопределено Тогда
		ТабДокумент = Новый ТабличныйДокумент;
	Иначе
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	Макет = ПолучитьМакет(ИмяМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Титул");
	ОбластьМакета.Параметры.НаименованиеНПФ = Организация.НаименованиеПолное;
	Фамилия = Шапка.Фамилия;
	Имя = Шапка.Имя;                
	Отчество = Шапка.Отчество;
	ДанныеОтветственного = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, Ответственный.ФизическоеЛицо, Дата);
	ФИООтветственного = ""+ДанныеОтветственного.Фамилия+" "+Лев(ДанныеОтветственного.Имя,1)+". "+Лев(ДанныеОтветственного.Отчество,1)+".";
	ДолжностьОтветственного = ДанныеОтветственного.Должность;
	
	ОбластьМакета.Параметры.ФамилияЗЛ = Фамилия;
	ОбластьМакета.Параметры.ИмяЗЛ = Имя;
	ОбластьМакета.Параметры.ОтчествоЗЛ = Отчество;
	Если Участник.уп_ФизЛицо.Пол=Перечисления.ПолФизическогоЛица.Женский Тогда
		ОбластьМакета.Параметры.КартинкаПолЖен = "V";
	ИначеЕсли Участник.уп_ФизЛицо.Пол=Перечисления.ПолФизическогоЛица.Мужской Тогда
		ОбластьМакета.Параметры.КартинкаПолМуж = "V";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДоговорОПС) Тогда
		ОбластьМакета.Параметры.НомерСчета = "";
	Иначе
		#Удаление
		ОбластьМакета.Параметры.НомерСчета = СокрЛП(ДоговорОПС.Код)+"/"+уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
		#КонецУдаления
		#Вставка
		// +ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокументаСервер()	// №3395
		ОбластьМакета.Параметры.НомерСчета = СокрЛП(ДоговорОПС.Код);
		// -ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокументаСервер()	// №3395
		#КонецВставки
	КонецЕсли;
	
	Если ИмяМакета = "Заявление2015" Тогда
		Если ТипПолучаемойПенсии = 1 Тогда
			ОбластьМакета.Параметры.Картинка1 = "V";
		ИначеЕсли ТипПолучаемойПенсии = 2 Тогда
			ОбластьМакета.Параметры.Картинка2 = "V";
		ИначеЕсли ТипПолучаемойПенсии = 3 Тогда
			ОбластьМакета.Параметры.Картинка3 = "V";
		ИначеЕсли ТипПолучаемойПенсии = 4 Тогда
			ОбластьМакета.Параметры.Картинка4 = "V";
		ИначеЕсли ТипПолучаемойПенсии = 5 Тогда
			ОбластьМакета.Параметры.Картинка5 = "V";
		Иначе
			ОбластьМакета.Параметры.Картинка1 = "";
			ОбластьМакета.Параметры.Картинка2 = "";
			ОбластьМакета.Параметры.Картинка3 = "";
			ОбластьМакета.Параметры.Картинка4 = "";
			ОбластьМакета.Параметры.Картинка5 = "";
		КонецЕсли;
	КонецЕсли;
	
	ОбластьМакета.Параметры.ДатаРождения = Формат(Участник.уп_ФизЛицо.ДатаРождения, "ДЛФ=DD");
	ОбластьМакета.Параметры.МестоРождения = ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(Участник.уп_ФизЛицо.МестоРождения);
	
	// создаем запрос для поиска в регистре сведений контактная информация
	// с параметрами юридический адрес контрагента, самого контрагента и отображаем в поле макета
	КонтактыЗЛ=ВыбратьКонтактыЗЛСервер();
	КонтактыЗЛ.Следующий();
	ЗаполнитьКонтактыЗЛСервер(КонтактыЗЛ,ОбластьМакета);
	
	Паспорт=ВыбратьПаспортДанныеСервер();
	Паспорт.Следующий();
	Граждаство=ОпределитьГражданствоСервер(Паспорт);
	ОбластьМакета.Параметры.ДокументУЛ = Паспорт.ДокументВид;
	ОбластьМакета.Параметры.СерияНомерПаспорта = ""+Паспорт.ДокументСерия+" №"+Паспорт.ДокументНомер;
	ОбластьМакета.Параметры.ДатаВыдачи = Паспорт.ДокументДатаВыдачи;
	ОбластьМакета.Параметры.ПаспортКемВыдан = Паспорт.ДокументКемВыдан;
	ОбластьМакета.Параметры.Гражданство_ЗЛ = Граждаство;
	
	ОбластьМакета.Параметры.НомерПФР = уп_ОПС.ПреобразоватьНомерПФР(Участник.уп_ФизЛицо.СтраховойНомерПФР);
	
	Если ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
		ОбластьМакета.Параметры.Картинка7 = "V";
	ИначеЕсли ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Почта
		или ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
		или ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
		или ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда
		ОбластьМакета.Параметры.Картинка8 = "V";
	ИначеЕсли ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
		ОбластьМакета.Параметры.Картинка9 = "V";
	Иначе
		ОбластьМакета.Параметры.Картинка7 = "";
		ОбластьМакета.Параметры.Картинка8 = "";
		ОбластьМакета.Параметры.Картинка9 = "";
	КонецЕсли;
	
	//параметры расчетного счета
	
	ОбластьМакета.Параметры.НомерРасчСчета = РасчетныйСчет.НомерСчета;
	ОбластьМакета.Параметры.НаименованиеБанка = РасчетныйСчет.Банк.Наименование;
	ОбластьМакета.Параметры.БИК = РасчетныйСчет.Банк.Код;
	ОбластьМакета.Параметры.КоррСчет = РасчетныйСчет.Банк.КоррСчет;
	
	ТабДокумент.Вывести(ОбластьМакета);
	Если ИмяМакета = "Заявление2019" Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); //-
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Оборот");
	
	
	Если ПодаетсяПредставителем Тогда
		ОбластьМакета.Параметры.ВидДППП=НаимДокПодтвПолнПредставителя;
		ОбластьМакета.Параметры.НомерДППП=СерияДокПодтвПолнПредставителя+" №"+НомерДокПодтвПолнПредставителя;
		ОбластьМакета.Параметры.ДатаВыдачиДППП=ДатаВыдачиДокПодтвПолнПредставителя1;
		ОбластьМакета.Параметры.КемВыданДППП=КемВыданДокПодтвПолнПредставителя2;                
		ВидДоверенногоЛица=ВыбратьВидДоверЛицаСервер();
		ВидДоверенногоЛица.Следующий();
		ПредставительЮрФизЛицо=ВидДоверенногоЛица.ПредставительЮрФизЛицо;
		//Подчеркивание типа представителя
		СплЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		ПодчеркнутьВидПредставительстваСервер(ОбластьМакета,СплЛиния);
		КонтактыПредставителяЗЛ=ВыбратьКонтактыПредставителяЗЛСервер();
		КонтактыПредставителяЗЛ.Следующий();
		
		РасшПредставителя= Строка(Шапка.ФамилияП+" "+Сред(Шапка.ИмяП,1,1)+ "." +Сред(Шапка.ОтчествоП,1,1)+".");
		
		//Заполнение адреса проживания и адреса пребывания представителя
		ЗаполнитьКонтактыПредставителяСервер(ОбластьМакета,КонтактыПредставителяЗЛ,Шапка);
		
		ПаспортПЗЛ=ПолучитьПаспортПЗЛСервер();
		ПаспортПЗЛ.Следующий();
		ДатаВыдачиДУЛПЗЛ = ПаспортПЗЛ.ДокументДатаВыдачи;
		ОбластьМакета.Параметры.ДокументУЛПЗЛ = ПаспортПЗЛ.ДокументВид;
		ОбластьМакета.Параметры.СерияНомерПаспортаДоверенного = ?(ПаспортПЗЛ.ДокументСерия=NULL,"",ПаспортПЗЛ.ДокументСерия)+" №"+?(ПаспортПЗЛ.ДокументНомер=NULL,"",ПаспортПЗЛ.ДокументНомер);
		ОбластьМакета.Параметры.ДатаВыдачиДоверенного = ДатаВыдачиДУЛПЗЛ;
		ОбластьМакета.Параметры.ПаспортКемВыданДоверенного = ПаспортПЗЛ.ДокументКемВыдан;
	КонецЕсли;
	
	//ОбластьМакета.Параметры.ДатаЗаявления = Дата;
	#Удаление
	ОбластьМакета.Параметры.ДатаРегистрации = ДатаРегистрации;
	#КонецУдаления
	#Вставка
	// +ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокументаСервер() // №3395
	ОбластьМакета.Параметры.ДатаРегистрации = Дата;
	// -ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокументаСервер // №3395
	#КонецВставки
	//ОбластьМакета.Параметры.НомерЗаявления = Номер; //-
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Должность
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(
	|			&Период,
	|			Сотрудник.ФизическоеЛицо = &ОтветственныйФизЛицо
	|				И Организация = &Организация) КАК РаботникиОрганизацийСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	РаботникиОрганизацийСрезПоследних.Период УБЫВ";		
	Запрос.УстановитьПараметр("Период", ДатаРегистрации);
	Запрос.УстановитьПараметр("ОтветственныйФизЛицо", Ответственный.ФизЛицо);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ТЗДолжностьОтветственного = Запрос.Выполнить().Выгрузить();
	
	//ТЗДолжностьОтветственного = РегистрыСведений.РаботникиОрганизаций.СрезПоследних(ДатаРегистрации, Новый Структура("ФизЛицо, Организация",Ответственный.ФизЛицо,Организация));
	Если ТЗДолжностьОтветственного.Количество()>0 Тогда
		ОбластьМакета.Параметры.ДолжностьОтветственного = ТЗДолжностьОтветственного.Получить(0).Должность;
	Иначе
		ОбластьМакета.Параметры.ДолжностьОтветственного = "";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		ФИООтветственного = "";
		ОбластьМакета.Параметры.ФИООтветственного = "";
	Иначе
		ОбластьМакета.Параметры.ФИООтветственного = ФИООтветственного;
		ОбластьМакета.Параметры.ДолжностьОтветственного = ДолжностьОтветственного;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	Если ИмяМакета = "Заявление2019" Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); //-
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Расписка");
	ОбластьМакета.Параметры.НаименованиеНПФ = Организация.НаименованиеПолное;
	ОбластьМакета.Параметры.ДатаРегистрации = ДатаРегистрации;
	ОбластьМакета.Параметры.НомерРасписки = Номер;
	ОбластьМакета.Параметры.ФИОЗЛица = ""+Фамилия+" "+Имя+" "+Отчество;
	#Удаление
	ОбластьМакета.Параметры.НомерСчетаЗЛица = СокрЛП(ДоговорОПС.Код)+"/"+уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
	#КонецУдаления
	#Вставка
	// +ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокументаСервер()	// №3395
	ОбластьМакета.Параметры.НомерСчетаЗЛица = СокрЛП(ДоговорОПС.Код);
	// -ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьДокументаСервер()	// №3395
	#КонецВставки
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		ФИООтветственного = "";
		ОбластьМакета.Параметры.ФИООтветственного = "";
	Иначе
		ОбластьМакета.Параметры.ФИООтветственного = ФИООтветственного;
		ОбластьМакета.Параметры.ДолжностьОтветственного = ДолжностьОтветственного;
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.АвтоМасштаб = Истина;
	Возврат ТабДокумент;
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьКонтактыЗЛСервер")
Процедура РасшОбщ_ЗаполнитьКонтактыЗЛСервер(КонтактыЗЛ,ОбластьМакета)
	Если  КонтактыЗЛ.ИнфАдр = NULL или КонтактыЗЛ.ИнфАдр = "" Тогда
		#Удаление
		ОбластьМакета.Параметры.АдрЗЛ_МПр = "Нет";
		#КонецУдаления
		#Вставка
		// +ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер() // №3395
		//ОбластьМакета.Параметры.АдрЗЛ_МПр = "Нет";		
		// -ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер // №3395
		#КонецВставки
	Иначе
		ОбластьМакета.Параметры.АдрЗЛ_МПр = КонтактыЗЛ.ИнфАдр;
	КонецЕсли;
	Если  КонтактыЗЛ.ЮрАдрес = NULL или КонтактыЗЛ.ЮрАдрес = "" Тогда
		#Удаление
		ОбластьМакета.Параметры.АдрЗЛ_МЖ = "Нет";		
		#КонецУдаления
		#Вставка
		// +ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер() // №3395
		//ОбластьМакета.Параметры.АдрЗЛ_МЖ = "Нет";
		// -ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер // №3395
		#КонецВставки
	Иначе
		ОбластьМакета.Параметры.АдрЗЛ_МЖ = КонтактыЗЛ.ЮрАдрес;
	КонецЕсли;
	Если (КонтактыЗЛ.ФактАдрес<>КонтактыЗЛ.ЮрАдрес И КонтактыЗЛ.ФактАдрес<>КонтактыЗЛ.ИнфАдр) ИЛИ ((КонтактыЗЛ.ЮрАдрес="" или КонтактыЗЛ.ЮрАдрес=NULL) И (КонтактыЗЛ.ИнфАдр="" или КонтактыЗЛ.ИнфАдр=NULL)) Тогда
		Если  КонтактыЗЛ.ФактАдрес = NULL или КонтактыЗЛ.ФактАдрес = "" Тогда
			#Удаление
			ОбластьМакета.Параметры.АдрЗЛ_ФактПр = "Нет";
			#КонецУдаления
			#Вставка
			// +ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер() // №3395
			//ОбластьМакета.Параметры.АдрЗЛ_ФактПр = "Нет";
			// -ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер // №3395
			#КонецВставки
		Иначе
			ОбластьМакета.Параметры.АдрЗЛ_ФактПр = КонтактыЗЛ.ФактАдрес;
		Конецесли;
	КонецЕсли;

	#Вставка
	// +ХМНПФ 10.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер() // №3395
	Если Не ЗначениеЗаполнено(ОбластьМакета.Параметры.АдрЗЛ_МЖ) И ЗначениеЗаполнено(ОбластьМакета.Параметры.АдрЗЛ_ФактПр) Тогда
		ОбластьМакета.Параметры.АдрЗЛ_МЖ = ОбластьМакета.Параметры.АдрЗЛ_ФактПр;
		ОбластьМакета.Параметры.АдрЗЛ_ФактПр = "";
	КонецЕсли;
	// -ХМНПФ 10.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер // №3395
	#КонецВставки
	//Телефон ЗЛ
	ОбластьМакета.Параметры.ТелЗЛ = КонтактыЗЛ.Тел;
	//Адреса лиц проживающих за границей
	Если ПроживаетЗаГраницей Тогда
		ОбластьМакета.Параметры.АдрЗЛ_МЖДрГос = КонтактыЗЛ.ИнострАдрес;
		//ОбластьМакета.Параметры.АдрЗЛ_МЖДоВыезда = КонтактыЗЛ.ЮрАдрес;
	КонецЕсли;
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура РасшОбщ_ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, Основание);

	Если (Основание = Неопределено) ИЛИ Не ЭтотОбъект.Метаданные().Реквизиты.ДокументОснование.Тип.СодержитТип(ТипЗнч(Основание)) Тогда
		Возврат;
	КонецЕсли;
	#Вставка
	// +ХМНПФ 26.10.2015 Шадрин А.В. // ОбработкаЗаполнения() // ОПС_заяв_на_основ_дгвр
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.уп_ЗаявлениеЗЛОНазначенииНЧТП") Тогда
	// -ХМНПФ 26.10.2015 Шадрин А.В. // ОбработкаЗаполнения() // ОПС_заяв_на_основ_дгвр
	#КонецВставки
	// Заполним реквизиты из стандартного набора по документу основанию.
	уп_ОсновнаяПоставкаСервер.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
	
	#Если Клиент Тогда
	Дата = РабочаяДата;
	#КонецЕсли

	#Вставка
	// +ХМНПФ 30.10.2015 Шадрин А.В. // ОбработкаЗаполнения() // №24
	#Если Сервер Тогда
	Дата = ТекущаяДата();
	#КонецЕсли
	// -ХМНПФ 30.10.2015 Шадрин А.В. // ОбработкаЗаполнения() // №24
	#КонецВставки
	ПараметрыДокументаОснования = уп_ОсновнаяПоставкаСервер.СформироватьСтруктуруШапкиДокумента(Основание);
	ВидДокументаОснования       = Основание.Метаданные().Имя;
	ДокументОснование           = ПараметрыДокументаОснования.Ссылка;
	
	ДоговорОПС = ПараметрыДокументаОснования.ДоговорОПС;
	Участник = ПараметрыДокументаОснования.ЗастрахованноеЛицо;
	ФормаВыплаты = ПараметрыДокументаОснования.ФормаВыплаты;
	РасчетныйСчет = ПараметрыДокументаОснования.РасчетныйСчет;
	ДоверенноеЛицо = ПараметрыДокументаОснования.ДоверенноеЛицо;
	ТипЛицевогоСчета = ПараметрыДокументаОснования.ТипЛицевогоСчета;
	НомерЛицевогоСчета = ПараметрыДокументаОснования.НомерЛицевогоСчета;
	Получатель = ПараметрыДокументаОснования.Получатель;
	НаимДокПодтвПолнПредставителя = ПараметрыДокументаОснования.НаимДокПодтвПолнПредставителя; 
	СерияДокПодтвПолнПредставителя = ПараметрыДокументаОснования.СерияДокПодтвПолнПредставителя;
	НомерДокПодтвПолнПредставителя = ПараметрыДокументаОснования.НомерДокПодтвПолнПредставителя;
	ДатаВыдачиДокПодтвПолнПредставителя1 = ПараметрыДокументаОснования.ДатаВыдачиДокПодтвПолнПредставителя1;
	КемВыданДокПодтвПолнПредставителя2 = ПараметрыДокументаОснования.КемВыданДокПодтвПолнПредставителя2;
	ТипПредставителя = ПараметрыДокументаОснования.ТипПредставителя;
	ОргПредставитель = ПараметрыДокументаОснования.ОргПредставитель;
	ПодаетсяПредставителем = ПараметрыДокументаОснования.ПодаетсяПредставителем;
	ПроживаетЗаГраницей = ПараметрыДокументаОснования.ПроживаетЗаГраницей;
	Представитель = ПараметрыДокументаОснования.Представитель;
	Если ПараметрыДокументаОснования.ФлагТрудоваяПенсияПоСтарости Тогда
		ТипПолучаемойПенсии = 4;
	ИначеЕсли ПараметрыДокументаОснования.СтрахЧастьТрудовойПенсииПоСтарости Тогда
		ТипПолучаемойПенсии = 5;
	КонецЕсли;
	НеУчитыватьДопВзносы = НЕ ПараметрыДокументаОснования.УчитыватьДопВзносы;
	СтрахЧастьС = ПараметрыДокументаОснования.СтрахЧастьС;
	ПравоНаНакопительнуюПенсию = ПараметрыДокументаОснования.ПравоНаНакопительнуюПенсию;
	РазмерГосПенсии = ПараметрыДокументаОснования.РазмерГосПенсии;

	#Вставка
	// +ХМНПФ 26.10.2015 Шадрин А.В. // ОбработкаЗаполнения() // ОПС_заяв_на_основ_дгвр
	ИначеЕсли ТипЗнч(Основание) = Тип("СправочникСсылка.уп_ДоговорыОПС") Тогда
		#Если Клиент Тогда
		Дата = РабочаяДата;
		#ИначеЕсли Сервер Тогда
		Дата = ТекущаяДата();
		#КонецЕсли
		Организация = Основание.Организация;
		ДоговорОПС = Основание;
		Участник = Основание.Участник;
		ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет;
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ОПС_заяв_на_основ_дгвр",Истина);
	КонецЕсли;
	// -ХМНПФ 26.10.2015 Шадрин А.В. // ОбработкаЗаполнения() // ОПС_заяв_на_основ_дгвр
	#КонецВставки
КонецПроцедуры

// +ХМНПФ 19.0217 Кучеров// Новая Функция ХМ_ПечатьWeb()
// для получения печатных форм со стороны Web сервисов
// аналог процедуры печать типового варианта пользовательского интерфейса
Функция РасшОбщ_ХМ_ПечатьWeb(ИмяМакета) Экспорт
	// Получить экземпляр документа на печать
	ТабДокумент = Новый ТабличныйДокумент; // заглушка если передали пустой макет
	Если      ИмяМакета = "Заявление" Тогда
		ТабДокумент = ПечатьДокумента("Заявление");
	КонецЕсли;
	
	Возврат ТабДокумент;
КонецФункции

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ = Неопределено, СтруктураТЧ = Неопределено) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	Если ЗначениеЗаполнено(НомерЛицевогоСчета) Тогда
		Движение = Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ЗастрахованноеЛицо = Участник;
		Движение.ФормаВыплаты = ФормаВыплаты;
		Движение.Банк = Получатель;
		Движение.РасчетныйСчет = РасчетныйСчет;
		Движение.ТипЛицевогоСчета = ТипЛицевогоСчета;
		Движение.НомерЛицевогоСчета = НомерЛицевогоСчета;
	КонецЕсли;
	
#Если Сервер Тогда
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц);
#КонецЕсли
КонецПроцедуры

&После("ПриУстановкеНовогоНомера")
Процедура ХМ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	ХМ_ПодпискиНаСобытия.ХМ_НомераРешенийПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс); 	
КонецПроцедуры
